# BritishThermalUnitsPerHourFootDegreeFahrenheit Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
UnitTypeId..::..BritishThermalUnitsPerHourFootDegreeFahrenheit Property
UnitTypeId Class See Also
---
British thermal units per hour foot degree Fahrenheit.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2021
# Syntax
C#
---
```text
public static ForgeTypeId BritishThermalUnitsPerHourFootDegreeFahrenheit { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property BritishThermalUnitsPerHourFootDegreeFahrenheit As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ BritishThermalUnitsPerHourFootDegreeFahrenheit {
	ForgeTypeId^ get ();
}
```

# See Also
UnitTypeId Class
Autodesk.Revit.DB Namespace